# Essential terminal utilities
tap "homebrew/services"
brew "git"
brew "postgresql"
brew "redis"
brew "imagemagick"
brew "mongodb"
brew "qt"
brew "watch"
brew "ssh-copy-id"
brew "heroku-toolbelt"
brew "autojump"
brew "nano"
brew "curl", args: ["with-openssl"]

# Essential Mac applications
tap "caskroom/cask"
tap "caskroom/versions"

# Browsers
cask "google-chrome"
cask "firefox"
cask "opera"

# Tools
cask "the-unarchiver"
cask "spectacle"
cask "1password"
cask "coconutbattery"
cask "vlc"
cask "zeplin"
cask "cleanmymac"
cask "scroll-reverser"

# Messengers
cask "telegram"
cask "slack"
cask "skype"
cask "discord"

# Development
cask "java"
cask "visual-studio-code"
cask "postman"
cask "dash"
cask "filezilla"

# Node
brew "nvm"
brew "yarn"

# Ruby
brew "rbenv"
brew "ruby-build"
brew "rbenv-default-gems"
