# Essential terminal utilities
tap "homebrew/services"
tap "homebrew/cask"

brew "ansible"
brew "autojump"
brew "git"
brew "htop"
brew "imagemagick"
brew "nano"
brew "openssl"
brew "overmind"
brew "postgresql@13", restart_service: true
brew "redis", restart_service: true
brew "ssh-copy-id"
brew "tmux"

# Node
brew "nvm"
brew "yarn"

# Ruby
brew "rbenv"

# Go
brew "go"

# Python
brew "python"

# iOS
brew "cocoapods"
brew "watchman"

# Essential Mac applications
# Applications
cask "1password"
cask "cleanmymac"
cask "fluor"
cask "rectangle"
cask "spotify"
cask "the-unarchiver"
cask "vlc"

# Browsers
cask "google-chrome"

# Messengers
cask "discord"
cask "messenger"
cask "slack"
cask "telegram"
cask "whatsapp"
cask "zoom"

# Design
cask "figma"

# Development
cask "boop"
cask "docker"
cask "visual-studio-code"
cask "warp"

# Gaming
cask "epic-games"
cask "steam"
