# Essential utilities
brew "ansible"
brew "autojump"
brew "e2fsprogs"
brew "ffmpeg"
brew "gh"
brew "git"
brew "htop"
brew "imagemagick"
brew "mole"
brew "nano"
brew "openssl"
brew "overmind"
brew "postgresql@13", restart_service: true
brew "redis", restart_service: true
brew "ssh-copy-id"

# Node
brew "nvm"
brew "yarn"

# Ruby
brew "rbenv"

# Go
brew "go"

# Python
brew "python"

# iOS
brew "cocoapods"
brew "watchman"

# Essential Mac applications
# Applications
cask "chatgpt"
cask "claude"
cask "google-chrome"
cask "karabiner-elements"
cask "obsidian"
cask "spotify"
cask "transmission"
cask "vlc"

# Messengers
cask "discord"
cask "slack"
cask "telegram"
cask "whatsapp"
cask "zoom"

# Design
cask "figma"

# Development
cask "boop"
cask "claude-code"
cask "cursor"
cask "cyberduck"
cask "docker-desktop"
cask "lm-studio"
cask "warp"

# Gaming
cask "steam"
